package lab3.car;

public class CarTest {

    /*
    * 01 - машина выключена проверка начальных состояний (скорость, направление, передача, выключенность)
    * 02 - машина выключена, нельзя изменить скорость и пердачу
    * 03 - машину выключена, нельзя выключить повторно
    * 04 - машина включена, нельзя включить повторно
    * 05 - можно выключить включённую машину
    * 06 - можно включить выключенную машину
    *     вкл:
    * 07 - стоим: смогли переключить на первую передачу и поехать (скорость, передача и направление движения)
    * 08 - стоим: смогли переключиться на задний ход (скорость, передача и направление движения)
    * 09 - стоим: не можем переключиться на 5ую предачу
    * 10 - едем: переключение с 1ой на 5ую передачу не получается
    * 11 - едем: переключение с 1ой на -1ую передачу нельзя
    * 12 - переключение скоростей с 0 на -1 на 0 и на 5 (граничная скорость или не в диапазоне)
    * 13 - когда движемся и передача нейтральная, то движение остается пока не станет "стоим" (перед/зад)
    * 14 - когда передача -1, не можем переключить на 1
    * 15 - нельзя в движении выключить машину
    *
    * */
}
